Autodesk.Revit.DB.AdaptivePointOrientationType
An enumerated type containing possible orientation types for Adaptive Points.
Since:
2012

Autodesk.Revit.DB.AdaptivePointOrientationType.FamilyOrthogonal
Point is oriented orthogonally on placement in the FamilyInstace's coordinate system.
This value is optimal for performance of families.

Autodesk.Revit.DB.AdaptivePointOrientationType.FamilyVertical
Point is oriented vertically on placement in the FamilyInstace's coordinate system.

Autodesk.Revit.DB.AdaptivePointOrientationType.PlacementOrthogonal
Point is oriented orthogonally on placement.

Autodesk.Revit.DB.AdaptivePointOrientationType.PlacementVertical
Point is oriented vertically on placement.

Autodesk.Revit.DB.AdaptivePointOrientationType.HostReferenceAutoFlip
Follows the orientation of the host reference point on placement but calculates
and aligns its flip sense with FamilyInstace's coordinate system.

Autodesk.Revit.DB.AdaptivePointOrientationType.HostReferenceStrictly
Strictly follows the orientation of the host reference point on placement.